#include <locale.h>
#include <stdio.h>
#include <math.h>

int main()
{
	setlocale(LC_CTYPE, "");

	dz();
}

int dz()
{
	//Контрольный пример 1
	//Входные данные:
	//x = 1
	//y = 0
	//Выходные данные:
	//Точка принадлежит области

	//Контрольный пример 2
	//Входные данные:
	//x = 8
	//y = 4
	//Выходные данные:
	//Точка не принадлежит области

	double x, y;
	printf("Введите x и y\n");
	scanf("%lf, %lf",&x, &y);
	double r = sqrt(pow(x, 2) + pow(y, 2));
	if ((r <= 1) || (r >= 2 && r <= 3))
	{
		printf("Радиус = %.2lf. Заданная пользователем точка с координатами (%.2lf, %.2lf) принадлежит заданным заштрихованным областям\n", r, x, y);

	}
	else
		printf("Радиус = %.2lf. Заданная пользователем точка с координатами (%.2lf, %.2lf) не принадлежит заданным заштрихованным областям\n", r, x, y);

	return 0;
}